# Дан список чисел. Определите,
# сколько в нем встречаються различных чисел
# Пример: Input: [1,1,2,0,-1,3,4,4]
#         Output: 6
list = [1,1,2,0,-1,3,4,4]
print(len(set(list)))